MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX450F256H.atdf
         <module id="00740" name="ICAP" version="">
            <instance name="ICAP1">
               <register-group address-space="periph0" name="ICAP" name-in-module="ICAP" offset="0x1f802000" />
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
               </parameters>
            </instance>
            <instance name="ICAP2">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
               </parameters>
            </instance>
            <instance name="ICAP3">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
               </parameters>
            </instance>
            <instance name="ICAP4">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
               </parameters>
            </instance>
            <instance name="ICAP5">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
               </parameters>
            </instance>
         </module>
         <module id="01618" name="INT" version="">
            <instance name="INT">
               <register-group address-space="periph2" name="INT" name-in-module="INT" offset="0x1f881000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01390" name="NVM" version="">
            <instance name="NVM">
               <register-group address-space="periph1" name="NVM" name-in-module="NVM" offset="0x1f80f400" />
               <parameters>
                  <param name="PAGE_SIZE" value="4096"/>
                  <param name="ROW_SIZE" value="512"/>
               </parameters>
            </instance>
         </module>
         <module id="00749" name="OCMP" version="">
            <instance name="OCMP1">
               <register-group address-space="periph0" name="OCMP" name-in-module="OCMP" offset="0x1f803000" />
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
               </parameters>
            </instance>
            <instance name="OCMP2">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
               </parameters>
            </instance>
            <instance name="OCMP3">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
               </parameters>
            </instance>
            <instance name="OCMP4">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
               </parameters>
            </instance>
            <instance name="OCMP5">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
               </parameters>
            </instance>
         </module>
         <module id="01416" name="OSC" version="">
            <instance name="OSC">
               <register-group address-space="periph1" name="OSC" name-in-module="OSC" offset="0x1f80f000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00815" name="PCACHE" version="">
            <instance name="PCACHE">
               <register-group address-space="periph2" name="PCACHE" name-in-module="PCACHE" offset="0x1f884000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00751" name="PMP" version="">
            <instance name="PMP">
               <register-group address-space="periph0" name="PMP" name-in-module="PMP" offset="0x1f807000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02028" name="RCON" version="">
            <instance name="RCON">
               <register-group address-space="periph1" name="RCON" name-in-module="RCON" offset="0x1f80f600" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01618" name="RPOR" version="">
            <instance name="RPOR">
               <register-group address-space="periph1" name="RPOR" name-in-module="RPOR" offset="0x1f80fb40" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00748" name="RTCC" version="">
            <instance name="RTCC">
               <register-group address-space="periph0" name="RTCC" name-in-module="RTCC" offset="0x1f800200" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01329" name="SPI" version="">
            <instance name="SPI1">
               <register-group address-space="periph0" name="SPI" name-in-module="SPI" offset="0x1f805800" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="SPI2">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00687" name="TMR1" version="">
            <instance name="TMR1">
               <register-group address-space="periph0" name="TMR1" name-in-module="TMR1" offset="0x1f800600" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00745" name="TMR" version="">
            <instance name="TMR2">
               <register-group address-space="periph0" name="TMR" name-in-module="TMR" offset="0x1f800800" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
