MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX450F256H.atdf
      <value-group caption="Reference Clock Request Status bit" name="REFOCON__ACTIVE">
         <value caption="Reference clock request is active" name="ACTIVE" value="0x1" />
         <value caption="Reference clock request is not active" name="INACTIVE" value="0x0" />
      </value-group>
      <value-group caption="Divider Switch Enable bit" name="REFOCON__DIVSWEN">
         <value caption="Divider switch is in progress" name="IN_PROGRESS" value="0x1" />
         <value caption="Divider switch is complete" name="DONE" value="0x0" />
      </value-group>
      <value-group caption="Reference Oscillator Module Run in Sleep bit" name="REFOCON__RSLP">
         <value caption="Reference Oscillator Module output continues to run in Sleep" name="ENABLE" value="0x1" />
         <value caption="Reference Oscillator Module output is disabled in Sleep" name="DISABLE" value="0x0" />
      </value-group>
      <value-group caption="Reference Clock Output Enable bit" name="REFOCON__OE">
         <value caption="Reference clock is driven out on REFCLKO pin" name="ENABLE" value="0x1" />
         <value caption="Reference clock is not driven out on REFCLKO pin" name="DISABLE" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Stop in Idle Mode bit" name="REFOCON__SIDL">
         <value caption="Discontinue module operation when device enters Idle mode" name="ENABLE" value="0x1" />
         <value caption="Continue module operation in Idle mode" name="DISABLE" value="0x0" />
      </value-group>
      <value-group caption="Output Enable bit" name="REFOCON__ON">
         <value caption="Reference Oscillator Module is enabled" name="ENABLE" value="0x1" />
         <value caption="Reference Oscillator Module is disabled" name="DISABLE" value="0x0" />
      </value-group>
      <value-group caption="Reference Clock Divider bits" name="REFOCON__RODIV">
         <value caption="Reference Clock output is same as source clock" name="NO_DIV" value="0x0" />
         <value caption="Reference Clock output is source clock divided by 2" name="DIV_2" value="0x1" />
         <value caption="Reference Clock output is source clock divided by 4" name="DIV_4" value="0x2" />
         <value caption="Reference Clock output is source clock divided by 65534" name="DIV_65534" value="0x7FFF" />
      </value-group>
      <value-group caption="Reference Oscillator Trim bits" name="REFOTRIM__ROTRIM">
         <value caption="511/512 divisor added to RODIV value" name="DIV_511" value="0x1ff" />
         <value caption="510/512 divisor added to RODIV value" name="DIV_510" value="0x1fe" />
         <value caption="256/512 divisor added to RODIV value" name="DIV_256" value="0x100" />
         <value caption="2/512 divisor added to RODIV value" name="DIV_2" value="0x2" />
         <value caption="1/512 divisor added to RODIV value" name="DIV_1" value="0x1" />
         <value caption="0/512 divisor added to RODIV value" name="DIV_0" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00815" name="PCACHE" version="1">
      <register-group name="PCACHE">
         <register caption="Cache Control Register" name="CHECON" offset="0x0" rw="RW" size="4">
            <bitfield caption="PFM Access Time Defined in Terms of SYSLK Wait States bits" mask="0x00000007" name="PFMWS" values="CHECON__PFMWS" />
            <bitfield caption="Predictive Prefetch Enable bits" mask="0x00000030" name="PREFEN" values="CHECON__PREFEN" />
            <bitfield caption="Data Cache Size in Lines bits" mask="0x00000300" name="DCSZ" values="CHECON__DCSZ" />
            <bitfield caption="Cache Coherency Setting on a PFM Program Cycle bit" mask="0x00010000" name="CHECOH" values="CHECON__CHECOH" />
         </register>
         <register caption="Cache Access Register" name="CHEACC" offset="0x10" rw="RW" size="4">
            <bitfield caption="Cache Line Index bits" mask="0x0000000F" name="CHEIDX" values="CHEACC__CHEIDX" />
            <bitfield caption="Cache Access Enable bits for registers CHETAG" mask="0x80000000" name="CHEWEN" values="CHEACC__CHEWEN" />
         </register>
         <register caption="Cache TAG Register" name="CHETAG" offset="0x20" rw="RW" size="4">
            <bitfield caption="Line Type bit" mask="0x00000002" name="LTYPE" values="CHETAG__LTYPE" />
            <bitfield caption="Line Lock bit" mask="0x00000004" name="LLOCK" values="CHETAG__LLOCK" />
            <bitfield caption="Line Valid bit" mask="0x00000008" name="LVALID" values="CHETAG__LVALID" />
            <bitfield mask="0x00FFFFF0" name="LTAG" />
            <bitfield caption="Line TAG Address Boot bit" mask="0x80000000" name="LTAGBOOT" values="CHETAG__LTAGBOOT" />
         </register>
         <register caption="Cache TAG Mask Register" name="CHEMSK" offset="0x30" rw="RW" size="4">
            <bitfield caption="Line Mask bits" mask="0x0000FFE0" name="LMASK" values="CHEMSK__LMASK" />
         </register>
         <register caption="Cache Word 0" name="CHEW0" offset="0x40" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="CHEW0" />
         </register>
         <register caption="Cache Word 1" name="CHEW1" offset="0x50" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="CHEW1" />
         </register>
         <register caption="Cache Word 2" name="CHEW2" offset="0x60" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="CHEW2" />
         </register>
         <register caption="Cache Word 3" name="CHEW3" offset="0x70" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="CHEW3" />
         </register>
         <register caption="Cache LRU Register" name="CHELRU" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x01FFFFFF" name="CHELRU" />
         </register>
         <register caption="Cache Hit Statistics Register" name="CHEHIT" offset="0x90" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="CHEHIT" />
         </register>
         <register caption="Cache Miss Statistics Register" name="CHEMIS" offset="0xa0" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="CHEMIS" />
         </register>
         <register caption="" name="RESERVED1" offset="0xb0" rw="R" size="4" />
         <register caption="Prefetch Cache Abort Statistics Register" name="CHEPFABT" offset="0xc0" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="CHEPFABT" />
         </register>
      </register-group>
      <value-group caption="PFM Access Time Defined in Terms of SYSLK Wait States bits" name="CHECON__PFMWS">
         <value caption="Seven Wait states" name="" value="0x7" />
         <value caption="Six Wait states" name="" value="0x6" />
         <value caption="Five Wait states" name="" value="0x5" />
         <value caption="Four Wait states" name="" value="0x4" />
         <value caption="Three Wait states" name="" value="0x3" />
         <value caption="Two Wait states" name="" value="0x2" />
         <value caption="One Wait state" name="" value="0x1" />
         <value caption="Zero Wait state" name="" value="0x0" />
      </value-group>
      <value-group caption="Predictive Prefetch Enable bits" name="CHECON__PREFEN">
         <value caption="Enable predictive prefetch for both cacheable and non-cacheable regions" name="" value="0x3" />
         <value caption="Enable predictive prefetch for non-cacheable regions only" name="" value="0x2" />
         <value caption="Enable predictive prefetch for cacheable regions only" name="" value="0x1" />
         <value caption="Disable predictive prefetch" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Cache Size in Lines bits" name="CHECON__DCSZ">
         <value caption="Enable data caching with a size of 4 Lines" name="" value="0x3" />
         <value caption="Enable data caching with a size of 2 Lines" name="" value="0x2" />
         <value caption="Enable data caching with a size of 1 Line" name="" value="0x1" />
         <value caption="Disable data caching" name="" value="0x0" />
      </value-group>
